[
{"company_name": "Tata Projects", "linkedin_followers_count": 2267180, "company_logo_url": "https://media.licdn.com/dms/image/v2/C510BAQHU5hJlxxZ_Pw/company-logo_200_200/company-logo_200_200/0/1630590126915/tata_projects_logo?e=2147483647&v=beta&t=IS6Q2jtZWyvf742Ad87viWleAxO1D3T4Btva1sAXkPQ", "about_us": "Tata Projects is one of the most admired Technology led Engineering, Procurement and Construction (EPC) companies in India. We have expertise in providing sustainable solutions in the execution of large and complex urban and industrial infrastructure projects while also demonstrating strong presence in refineries and petrochemical plants. We leverage our domain knowledge across various business segments to address the shift to clean energy to meet the nation’s Net Zero ambitions.\n\nWe provide ready-to-deploy solutions for semiconductor facilities, giga factories, data centres, refineries, green fuels, roads, bridges, integrated rail & metro systems, commercial building & airports, power generation, transmission & distribution systems, chemical process plants, water & waste management, and mining & metal purification systems.\n\nTata Projects offers one stop service covering entire life cycle of the project, from project conceptualization to operations & maintenance. It uses innovative technology solutions to offer bouquet of services which includes engineering, procurement, construction, commissioning, inspection & expediting, operations, repairs & maintenance, and shutdown services.\n\nOver the years, Tata Projects has received several awards and recognitions for its project delivery and commitment to safety & quality.\n\nWe are a part of the TATA Group which operates in more than 100 countries across six continents, with a mission ‘To improve the quality of life of the communities we serve globally, through long-term stakeholder value creation based on Leadership with Trust’. In 2023-24, the revenue of Tata companies, taken together, was $165Billion. These companies collectively employ over 10,00,000 people.\n\n*Caution against fraudulent job offers*: Tata Projects does not charge/accept any amount or security deposit from job seekers during the selection process or while inviting candidates for an interview. To know more visit - www.tata.com/jobalert", "num_of_employees": "not-found", "website": "http://www.tataprojects.com", "industry": "Construction", "company_size_approx": "1,001-5,000", "headquarters": "Mumbai, Maharashtra", "type": "Privately Held", "founded": "1979", "specialties": "Power Generation, Transmission & Distribution, Oil, Gas & Hydrocarbon, Water & Waste Water, Metals & Minerals, Railways, Quality Services, Urban Infrastructure, Construction Services, Metros, Tunnels, Bridges, Expressways, Hydropower, and Smart Cities", "funding": "US$ 52.2M", "funding_total_rounds": 1, "funding_option": "Private equity", "last_funding_round": "Aug 27, 2015"},
{"company_name": "Myntra", "linkedin_followers_count": 1816223, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQHlxcq3wbl2IA/company-logo_200_200/company-logo_200_200/0/1719917177970/myntra_logo?e=2147483647&v=beta&t=FkfF5jhdEVJ3zt55YuOo5MZMmiASm4kR0VvfNL8tomg", "about_us": "Myntra is India’s leading e-commerce company committed to making fashion and lifestyle products accessible to everyone. We create solutions that disrupt the ordinary and help make the world a happier, more fashionable place. \n\nWe are a company that is constantly evolving into newer and better forms and we look for people who are ready to evolve with us. From our beginnings as a customization company in 2007 to being technology and fashion pioneers today, Myntra is going places and we want you to take this journey with us.\n\nOur Culture\nAs self-driven, motivated individuals who believe in taking ownership instead of being handed responsibility, we are a curiously non-hierarchical team who believe in working as a whole to take the Organization forward. \n\nFirm believers of meritocracy, we encourage you to take on tasks and readily empower you with the right tools, space, and opportunities. In essence, work at Myntra is challenging but fun - we believe in equal opportunity, encourage intellectual curiosity and empower you to be the change.\n\nIf you’re just as passionate about fashion and would love a workplace that is purely result-driven, Myntra is the place for you!\n\nCheck out open jobs on https://boards.greenhouse.io/myntra", "num_of_employees": "not-found", "website": "https://www.life.myntra.com", "industry": "Software Development", "company_size_approx": "1,001-5,000", "headquarters": "Bangalore, Karnataka", "type": "Privately Held", "founded": "2007", "specialties": "Largest current season product catalog, Fashion Etailer, M-Commerce, Myntra Fashion Brands, Try And Buy, ecommerce, internet, omnichannel, omni-channel, and Private Fashion Labels", "funding": "US$ 54.0M", "funding_total_rounds": 15, "funding_option": "Corporate round", "last_funding_round": "Feb 1, 2024"},
{"company_name": "Hexaware Technologies", "linkedin_followers_count": 1473928, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQGVuPcKyowdig/company-logo_200_200/company-logo_200_200/0/1719899292683/hexaware_technologies_logo?e=2147483647&v=beta&t=7izQZm_ctCam-qToENumaJroit_Vcdy18wSikMAfAEg", "about_us": "At Hexaware, we're not just a global technology and business process services company; we're a community of 27,000 Hexawarians dedicated to one singular purpose: creating smiles through the power of great people and technology. With a presence in 40+ offices across 19 countries, we empower enterprises worldwide to embark on their digital transformation journey with unparalleled scale and speed. \n\nAs an employer, we're more than just a workplace. We put our people first, foster diversity and inclusivity, and prioritize their growth through robust learning and development programs. Our culture is a canvas for innovation as we work toward our shared vision of becoming the world’s most loved digital transformation partner.\n\nExciting, isn’t it? Visit www.hexaware.com to join us in embracing the magic of technology, as we passionately advocate for its potential to transform lives today and shape a brighter future. Together, we'll make the digital world a better place.", "num_of_employees": "not-found", "website": "http://www.hexaware.com", "industry": "IT Services and IT Consulting", "company_size_approx": "10,001+", "headquarters": "Navi Mumbai, Maharashtra", "type": "Public Company", "specialties": "Banking, Financial Services, Healthcare, Insurance, Travel, Transportation, Manufacturing & Consumer, Application Transformation, Enterprise Solutions, BI & Analytics, Digital Assurance, Infrastructure Management Services, Business Process Services., Professional Services, Automation, Cloud, and Customer experience", "funding": "not-found", "funding_total_rounds": 3, "funding_option": "Post IPO equity", "last_funding_round": "Feb 1, 2013"},
{"company_name": "Credit Suisse", "linkedin_followers_count": "not-found", "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQHszQ7sfR8SEw/company-logo_200_200/company-logo_200_200/0/1653986126825/credit_suisse_logo?e=2147483647&v=beta&t=kWqkLcnpt6KeDfjpIxAMyjXtSonIP5FrNZwaP8O6GJo", "about_us": "Credit Suisse Group AG has been acquired by UBS Group AG. \n\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management, and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it’s our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. \n\nReady to be part of #teamUBS and make an impact? Visit our Jobs section to explore the current job openings or visit https://www.ubs.com/global/en/careers.html \nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills, and experiences within our workforce.\n\nwww.ubs.com/social-legal", "num_of_employees": "not-found", "website": "http://www.credit-suisse.com/", "industry": "Banking", "company_size_approx": "10,001+", "headquarters": "Zurich", "type": "Public Company", "founded": "1856", "specialties": "Private Banking & Wealth Management and Investment Banking", "funding": "not-found", "funding_total_rounds": 1, "funding_option": "Post IPO equity", "last_funding_round": "Dec 24, 2022"},
{"company_name": "airtel", "linkedin_followers_count": 1402392, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQEe3Kkqr6IUSA/company-logo_200_200/company-logo_200_200/0/1666868267320/airtel_logo?e=2147483647&v=beta&t=kog32NY0c_PlqCoDByIo_Mw2dnPczyhxpVb4Fl80WGg", "about_us": "Airtel was founded to provide global connectivity and unlock endless opportunities. Our organization embodies a unique blend of energy, innovation, creativity, dedication, scale, and ownership, all aimed at being limitless. At Airtel, we strive to go beyond our duties to create impactful solutions for our consumers. \n \nOur team is highly skilled and constantly growing, actively developing infrastructure to introduce cutting-edge technologies like 5G, IoT, IQ, and Airtel Black. We have successfully launched 5G services in over 5,000 cities and towns nationwide, with 10 million unique customers on the 5G network nationally. Airtel Black is another convenient consumer service that provides combined billing for family and friends under a single bill. We also offer enterprise solutions, including national and international long-distance services for carriers. With a subscriber base exceeding 574 million as of 2023, we are committed to delivering effective products that contribute to the realization of a 'Digital India', enabling millions of individuals to connect and thrive for a brighter future. \n \nOur presence spans 7,915 census and 802,577 non-census towns and villages, covering almost 96% of the country's population with 388,726 Rkms of optical fiber and an extensive distribution network of 1.2 million outlets. We've also implemented conservation initiatives that have saved 14,676 MWh of electricity, 4412 tonnes of paper through our e-bill initiatives, and recycled 3330 tonnes of e-waste. \n \nAt Airtel, we believe in taking early ownership, delivering quality, and experimenting with various career paths to boost our trajectories and gain valuable insights into the business, making us the best in the industry. We are committed to creating the ultimate experience for our consumers while maintaining an ecological balance in the world.", "num_of_employees": "not-found", "website": "https://careers.airtel.com/", "industry": "Telecommunications", "company_size_approx": "10,001+", "headquarters": "Gurgaon, Haryana", "type": "Public Company", "specialties": "Mobile Voice & Data Services, Broadband (Fixed, 3G and 4G), Digital TV, Enterprise & International Carrier Services, Payments Bank, Music, Entertainment, and Internet TV", "funding": "US$ 1.6B", "funding_total_rounds": 8, "funding_option": "Post IPO secondary", "last_funding_round": "Sep 25, 2022"},
{"company_name": "Coface", "linkedin_followers_count": 234832, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQGznlBi5QqWlQ/company-logo_200_200/company-logo_200_200/0/1643368229192/coface_logo?e=2147483647&v=beta&t=Hm_dw2idMrrZXJP3DoK2_wgvOmPdLxuXW0wsZcFcbtk", "about_us": "With over 75 years of experience and the most extensive international network, Coface is a leader in trade credit insurance & risk management, and a recognized provider of Factoring, Debt Collection, Single Risk insurance, Bonding, and Information Services.\n\nCoface’s experts work to the beat of the global economy, helping ~100,000 clients in 100 countries build successful, growing, and dynamic businesses. \n\nWith Coface’s insight and advice, these companies can make informed decisions.\n\nThe Group' solutions strengthen their ability to sell by providing them with reliable information on their commercial partners and protecting them against non-payment risks, both domestically and for export.\n\nIn 2023, Coface employed ~4,970 people and registered a turnover of €1.868 billion.", "num_of_employees": "not-found", "website": "https://www.coface.com", "industry": "Insurance", "company_size_approx": "1,001-5,000", "headquarters": "Bois-Colombes, Paris Area", "type": "Privately Held", "specialties": "Credit Insurance, Unpaid invoices, Credit risks, credit-insurance, Protect your receivables, Trade receivables management, Debt collection, Bonding, Factoring, Economic Research, Information, and Trade Credit Insurance", "funding": "US$ 327.5M", "funding_total_rounds": 1, "funding_option": "Post IPO debt", "last_funding_round": "Dec 21, 2023"},
{"company_name": "Megha Engineering and Infrastructures Ltd (MEIL)", "linkedin_followers_count": 224627, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQEUn5DiZK6TWQ/company-logo_200_200/company-logo_200_200/0/1715935769527/meilofficial_logo?e=2147483647&v=beta&t=14RSRWDbg408_cepZbTgE54j2iVbMzAhVEMucr70jsk", "about_us": "MEIL is a diverse industrial conglomerate, established in 1989. It is a fast-growing global scale company that has completed many classic landmark projects featuring the changes of the times and commemorating economic and cultural development. It has also built many major infrastructure projects across the globe to improve people's livelihood. \n\nMEIL operates through its major business lines such as water management, engineering, construction, manufacturing, transportation, hydrocarbons, power, process industries, and defense. MEIL strives to utilise the indigenous technological innovations for the common benefit of all sections of society. \n\nFor more than 30 years, the company has maintained its leading position in its major businesses by putting the client first and adhering to safety and environmental requirements. MEIL is committed to delivering projects 'On-Time' by constantly evolving industry-leading knowledge, expertise, experience and employing innovative and impeccable process methodologies and technologies. \n\nAs a Global player MEIL has an unyielding focus on quality, technology, and value in everything it does.", "num_of_employees": "not-found", "website": "http://www.meil.com", "industry": "Construction", "company_size_approx": "10,001+", "headquarters": "Balanagar, TELANGANA", "type": "Privately Held", "founded": "1989"},
{"company_name": "Leica Geosystems part of Hexagon", "linkedin_followers_count": 216804, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGKp7UC5NiObg/company-logo_200_200/company-logo_200_200/0/1631346237825?e=2147483647&v=beta&t=FhOd9x5GM8Rc00fH7KCe3PD1e1Oj-DyrZdcRpvi4Ix0", "about_us": "Revolutionising the world of measurement and survey for 200 years, Leica Geosystems, part of Hexagon, creates complete solutions for professionals across the planet. Known for premium products and innovative solution development, professionals in a diverse mix of industries, such as aerospace and defence, safety and security, construction, and manufacturing, trust Leica Geosystems for all their geospatial needs. With precise and accurate instruments, sophisticated software, and trusted services, Leica Geosystems delivers value every day to those shaping the future of our world.", "num_of_employees": "not-found", "website": "http://www.leica-geosystems.com", "industry": "Information Technology & Services", "company_size_approx": "1,001-5,000", "headquarters": "Heerbrugg, St. Gallen", "type": "Public Company", "founded": "1819"},
{"company_name": "[24]7.ai", "linkedin_followers_count": 212517, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQHxJyAxHZaGSA/company-logo_200_200/company-logo_200_200/0/1720464895560?e=2147483647&v=beta&t=7RpQdY0hP0UGXiy5vnGWAVfBb1Gr8ouJXEN9zGgc03w", "about_us": "[24]7.ai™ customer engagement solutions use conversational artificial intelligence to understand customer intent, enabling companies to create personalized, predictive, and effortless customer experiences across all channels; attract and retain customers; boost agent productivity and satisfaction; and drive revenues while lowering costs. The world’s largest and most recognizable brands use [24]7.ai intent-driven technologies to serve several hundred million visitors through billions of conversations annually, most of which are automated. The result is an order of magnitude improvement in digital adoption, customer satisfaction, and revenue growth. For more information, visit: www.247.ai.\n\n[24]7.ai is based in San Jose, California. [24]7.ai is a registered trademark of 24/7 Customer, Inc.", "num_of_employees": "not-found", "website": "https://www.247.ai/", "industry": "Software Development", "company_size_approx": "10,001+", "headquarters": "San Jose, California", "type": "Privately Held", "founded": "2000", "specialties": "Self-service, Online Customer Journeys, Customer Service Technology, Smart IVRs, Virtual Agents, Machine Learning, Artificial Intelligence, Customer Experience, Customer Engagement, Intent-Driven Engagement, CXaaS, Managed Customer Engagement, and Conversational AI", "funding": "US$ 22.0M", "funding_total_rounds": 1, "funding_option": "Series unknown", "last_funding_round": "Aug 24, 2003"},
{"company_name": "DMart - Avenue Supermarts Ltd", "linkedin_followers_count": 209145, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQFr01DeiClklg/company-logo_200_200/company-logo_200_200/0/1631388256549?e=2147483647&v=beta&t=cDkopTH_dFplgsPIIPQs0iCio1FHjCUhvsnJeso4j5g", "about_us": "“DMart is a one-stop supermarket chain that aims to offer customers a wide range of basic home and personal products under one roof. Each DMart store stocks home utility products - including food, toiletries, beauty products, garments, kitchenware, bed and bath linen, home appliances and more - available at competitive prices that our customers appreciate. Our core objective is to offer customers good products at great value.\n\nDMart was started by Mr. Radhakishan Damani and his family to address the growing needs of the Indian family. From the launch of its first store in Powai in 2002, DMart today has a well-established presence in 344 locations across Maharashtra, Gujarat, Andhra Pradesh, Madhya Pradesh, Karnataka, Telangana, Chhattisgarh, NCR, Tamil Nadu, Punjab and Rajasthan. With our mission to be the lowest priced retailer in the regions we operate, our business continues to grow with new locations planned in more cities.\n\nThe supermarket chain of DMart stores is owned and operated by Avenue Supermarts Ltd. (ASL). The company has its headquarters in Mumbai.”", "num_of_employees": "not-found", "website": "https://www.dmartindia.com", "industry": "Retail", "company_size_approx": "5,001-10,000", "headquarters": "Mumbai, Maharastra", "type": "Public Company", "founded": "2000"},
{"company_name": "Happiest Minds Technologies", "linkedin_followers_count": 207416, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHWwtin8dPOIg/company-logo_200_200/company-logo_200_200/0/1630664208921/happiest_minds_technologies_logo?e=2147483647&v=beta&t=y9zF_qOIl06jKIRhgDkneeK43S09WS7y3DXIEScrAVo", "about_us": "Happiest Minds Technologies Limited (NSE: HAPPSTMNDS), a Mindful IT Company, enables digital transformation for enterprises and technology providers by delivering seamless customer experiences, business efficiency and actionable insights. We do this by leveraging a spectrum of disruptive technologies such as: artificial intelligence, blockchain, cloud, digital process automation, internet of things, robotics/drones, security, virtual/augmented reality, etc. Positioned as ‘Born Digital . Born Agile’, our capabilities span digital solutions, infrastructure, product engineering and security. We deliver these services across industry sectors such as automotive, BFSI, consumer packaged goods, e-commerce, edutech, engineering R&D, hi-tech, manufacturing, retail and travel/transportation/hospitality. \nA Great Place to Work-Certified™ company, Happiest Minds is headquartered in Bangalore, India with operations in the U.S., UK, Canada, Australia and Middle East.", "num_of_employees": "not-found", "website": "https://www.happiestminds.com/", "industry": "Information Technology & Services", "company_size_approx": "5,001-10,000", "headquarters": "Bengaluru, Karnataka", "type": "Public Company", "founded": "2011", "specialties": "Cloud Computing, Mobility Services, Digital Transformation, Business intelligence, M2M, Internet of Things, Testing Services, IT Security Services, IT Services, Product Engineering Services, Infrastructure Management, Big Data, Business Analytics, and Predictive Analytics", "funding": "US$ 60.9M", "funding_total_rounds": 2, "funding_option": "Post IPO equity", "last_funding_round": "Aug 18, 2023"},
{"company_name": "Yulu", "linkedin_followers_count": 207636, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFBCkGHu02h1w/company-logo_200_200/company-logo_200_200/0/1666846487145/yulu_logo?e=2147483647&v=beta&t=c8CkYq-78_eSgr6lPje2InYt5gcj0KSMFEg91Ya-R3Y", "about_us": "Yulu is India's largest shared micro-mobility service provider using electric two-wheelers to reduce traffic congestion and air pollution in urban India. Yulu service is actively used for the last-mile commute as well as last-mile deliveries, making a real impact on India's goal of electrifying its mobility by 2030.\n\nYulu's mission is to create sustainable cities of tomorrow by revolutionizing the way people commute. Yulu’s technology-driven mobility platform uses IoT, ML, and AI for demand-supply management and efficient operations. Currently, Yulu is present in Bengaluru, Delhi NCR, and Greater Mumbai.", "num_of_employees": "not-found", "website": "http://www.yulu.bike", "industry": "Automotive", "company_size_approx": "201-500", "headquarters": "Bangalore, Karnataka", "type": "Privately Held", "founded": "2017", "specialties": "transportation, IoT, mobility, Sustainable mobility, bike sharing, sharing economy, green environment, Last Mile Delivery, Last Mile Commute, Daily Commute, Electric Mobility, EV, Electric Vehicles, E2W, and Miracle", "funding": "US$ 19.3M", "funding_total_rounds": 9, "funding_option": "Series B", "last_funding_round": "Mar 23, 2024"},
{"company_name": "mthree", "linkedin_followers_count": "not-found", "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQGwCsz_B7PeWw/company-logo_200_200/company-logo_200_200/0/1719256553345/mthree_logo?e=2147483647&v=beta&t=8FF7gknogA-s98EP7Mij4k29FoSgfGGi1aW_F5-xovE", "about_us": "mthree helps organisations succeed by building job-ready teams with the most in-demand skills.\n\nWe bridge the skills gap at every level in technology, business and banking. Whether we’re deploying trained emerging talent and seasoned experts or reskilling existing employees, we provide the people and skills you need across the globe.\n \nWe offer new ways to create high performance teams – complementing traditional strategies like recruitment, internal graduate programmes, and the big consultancies.", "num_of_employees": "not-found", "website": "https://mthree.com/", "industry": "IT Services and IT Consulting", "company_size_approx": "1,001-5,000", "headquarters": "London", "type": "Privately Held", "founded": "2010", "specialties": "Hire Train Deploy, Reskill, Junior Level Talent, Software Development, Data Analytics, Data Science, DevOps, SRE, Production Support, Linux, Python, SQL, MySQL, Cyber Security, Cloud Security, Salesforce, ServiceNow, Java, C#, Golang, React, Machine Learning, Big Data, AWS Cloud, and PMO", "funding": "US$ 57.9M", "funding_total_rounds": 1, "funding_option": "Private equity", "last_funding_round": "Sep 28, 2018"},
{"company_name": "Eventbrite", "linkedin_followers_count": 190299, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQFZ9YEntlWNUQ/company-logo_200_200/company-logo_200_200/0/1630597894645/eventbrite_logo?e=2147483647&v=beta&t=wg4TOasHGBQfZsvt_3Lb1ngCQWkCYq9oQHRhG2wUMHg", "about_us": "A global platform that allows anyone to create, share, find and attend events that fuel their passions. For support, please visit https://bit.ly/EBhelp", "num_of_employees": "not-found", "website": "http://www.eventbrite.com", "industry": "Software Development", "company_size_approx": "501-1,000", "headquarters": "San Francisco, California", "type": "Public Company", "specialties": "event ticketing, event registration, tickets, event planning, social commerce, event technology, ticketing, and event management", "funding": "US$ 225.0M", "funding_total_rounds": 11, "funding_option": "Post IPO equity", "last_funding_round": "Jun 11, 2020"},
{"company_name": "CHINT", "linkedin_followers_count": 173493, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQEvC5BZK-lZRw/company-logo_200_200/company-logo_200_200/0/1630549335273/chintelectric_logo?e=2147483647&v=beta&t=V0loZWB3s21Iw6hOalpr5MRrKacDCd7-F_pCSbSHIRs", "about_us": "CHINT was established in 1984 and built from the capital of approximately 8,000 US dollars. With our rapid development these years, CHINT has become the world's leading intelligent energy solutions provider for the whole industrial chain with the most complete product ranges, from Plant to Plug. In 2022, our annual sales revenue exceeded 18.24 billion dollars and total assets of more than 206.84 billion dollars. \nOver two decades of global expansion, our business network covers more than 140 countries and regions worldwide in areas of low-voltage, power transmission and distribution, water, gas and electricity metering, green energy like solar and more. CHINT has more than 40,000 employees worldwide, creating more than 200,000 jobs in the supply chains.\n\nContact us to learn more: \nglobal-sales@chint.com", "num_of_employees": "not-found", "website": "http://chintglobal.com", "industry": "Appliances, Electrical, and Electronics Manufacturing", "company_size_approx": "10,001+", "headquarters": "Shanghai, Shanghai", "type": "Privately Held", "founded": "1984", "specialties": "Photovoltaic Power Generation, Industrial Automation, Power Transmission and Distribution Equipment, Low-Voltage Electrical Apparatus, Instruments and Meters, Building Electrical Appliances, and Automotive Electrical", "funding": "US$ 319.2M", "funding_total_rounds": 1, "funding_option": "Post IPO equity", "last_funding_round": "Jan 22, 2023"},
{"company_name": "QIMA", "linkedin_followers_count": 175528, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQExFMOT0hrJOw/company-logo_200_200/company-logo_200_200/0/1708937193334/qima_logo?e=2147483647&v=beta&t=Pp_KQ2wo91eUclPdv_klX4r8MjuT-P1eAErdDwZ4yww", "about_us": "QIMA is more than a testing, inspection, certification, and compliance company: We are on a mission to offer clients smart solutions to make products consumers can trust.\n\nWith a global reach spanning 100+ countries, QIMA serves the consumer products, food and life sciences industries, supporting more than 30,000 brands, retailers, manufacturers and food growers.\n\nThe company combines on-the-ground expertise with digital solutions to bring accuracy and visibility for quality, safety and compliance data.\n\nWhat sets QIMA apart is its unique culture: 5,000 employees live and make decisions every day by the QIMA Values. With client passion, integrity, and a commitment to making things simple, QIMA continues to disrupt the Testing, Inspection and Certification industry.", "num_of_employees": "not-found", "website": "https://www.qima.com", "industry": "International Trade and Development", "company_size_approx": "5,001-10,000", "headquarters": "Hong Kong, Kwun Tong", "type": "Privately Held", "founded": "2005", "specialties": "certification, csr, sustainability, food safety, esg, traceability, life sciences, contract research outsourcing, quality control, product testing, supplier auditing, quality assurance, and product safety", "funding": "not-found", "funding_total_rounds": 1, "funding_option": "Private equity", "last_funding_round": "Jan 8, 2022"},
{"company_name": "Mahindra Holidays & Resorts India Limited", "linkedin_followers_count": 171140, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGpgCM-tHTILg/company-logo_200_200/company-logo_200_200/0/1645610309984/mahindra_holidays__resort_india_limited_logo?e=2147483647&v=beta&t=6roFrnxFMM4W3rHMX485UyqBuHpW919EDC48CWSqQF0", "about_us": "Mahindra Holidays & Resorts India Ltd. (MHRIL) is a part of the USD 20.7 billion multinational Mahindra Group. Started in 1996, the company's flagship brand viz. Club Mahindra, today has a fast-growing customer base of over 250,000+ members, who can holiday at 100+ resorts in India and in international destinations like Dubai, Thailand, Singapore, Malaysia, Sri Lanka, Bhutan, Finland, Sweden, Spain and USA. \n\nAt Club Mahindra, we believe in making magical moments for members and their families and delighting them with over 500 'Only at Club Mahindra' experiences.", "num_of_employees": "not-found", "website": "http://www.clubmahindra.com", "industry": "Hospitality", "company_size_approx": "10,001+", "headquarters": "Mumbai, Maharshtra", "type": "Public Company"},
{"company_name": "Cybergenta", "linkedin_followers_count": "not-found", "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQEQLqGWEQBryQ/company-logo_200_200/company-logo_200_200/0/1630630319591/cybergenta_logo?e=2147483647&v=beta&t=thyw1Yl5HdZj1GJJHxw1je3mz9CTfDi3UITG1O3vFK8", "about_us": "Cybergenta is a consultancy company focused on cyber security assisting businesses to achieve various means of compliance, including; Information Security Management, Advisory, Compliance, & Audit.", "num_of_employees": "not-found", "website": "https://www.cybergenta.com", "industry": "IT Services and IT Consulting", "company_size_approx": "2-10", "headquarters": "Coventry", "type": "Privately Held", "founded": "2023"},
{"company_name": "Cavista", "linkedin_followers_count": 168074, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHRJATTDYpKvQ/company-logo_200_200/company-logo_200_200/0/1630660643688/cavista_logo?e=2147483647&v=beta&t=eCRC-WaPrnvGnXmptzScf3_Vqa0Ni27vSgf0wKFg70w", "about_us": "Your Exciting Opportunity For A Rewarding Career\n\nOperating in the United States, Nigeria, India and the Philippines, Cavista’s mission is to empower the world’s best technology solutions. Through world-class consultation, innovative IT solutions and personalized client services, Cavista increases operational efficiency for organizations of all sizes. We're seeking talented individuals interested in a challenging and rewarding career. We're looking for the best and brightest, the forward-thinkers and problem-solvers who want a chance to change the world.\n\nThe Cavista Way\n\nCavista is committed to treating every employee as an individual, respecting their dignity and recognizing their merit. Our work environment encourages innovation, thinking outside the box and being entrepreneurial in thoughts and actions. Employees are an integral part of the company’s success, and take pride in creating their own ideal work environment. Cavista operates from offices in Nigeria, India and the Philippines.\n\nOur Global Partner\n\nCavista is a global partner of Axxess, the leading innovator in home healthcare technology around the world. With individuals from more than 40 countries, Axxess sets the standard for operational excellence in a diverse and inclusive environment. Fostering an award-winning culture that encourages success by meeting needs and solving challenges has been the key to its rapid growth since it was founded.", "num_of_employees": "not-found", "website": "http://www.cavistatech.com", "industry": "Information Technology & Services", "company_size_approx": "201-500", "headquarters": "Dallas, Texas", "type": "Privately Held"},
{"company_name": "Hunt for Success", "linkedin_followers_count": 168573, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQHb6nnl_TKBCQ/company-logo_200_200/company-logo_200_200/0/1630613373097?e=2147483647&v=beta&t=D1x9UNUMPWEIQAVwGkrz9UWROTejXUb0rkRiVUK82fs", "about_us": "Hunt for Success is a step taken to help anyone seeking employment of any kind (full-time job/internship/freelance) by providing information about all the relevant opportunities.\n\nWe know many companies are already doing work in the same domain but what we are doing is to make people know about all the openings as soon as they are posted. We will be posting about the opportunities that have been opened by the company in the last 24 hours. \n\nSo, this is the page where you be getting real-time updates of all the opportunities and make your search much easier. \n\nPlease note that we are not a recruitment company and we don't have any collaboration with any company. So, if any company or recruiter has any problem with us amplifying their job/internship through our page, you can let us know in the comments in the respective post of your company. We will take the post down. This is a non-profitable initiative for the people who remain unaware about different career opportunities.", "num_of_employees": "not-found", "website": "not-found", "industry": "1 employee", "company_size_approx": "Kanpur,", "headquarters": "not-found", "type": "2021"},
{"company_name": "CSG", "linkedin_followers_count": 165623, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQFl15L25m66Hg/company-logo_200_200/company-logo_200_200/0/1666182239941/csg__logo?e=2147483647&v=beta&t=kFBqnKfXUFYUFP7_BtnobAnKCGnkAxLBmheNpVkVsjQ", "about_us": "CSG is a leader in innovative customer engagement, revenue management and payments solutions that make ordinary customer experiences extraordinary. Our cloud-first architecture and customer-obsessed mindset help companies around the world launch new digital services, expand into new markets, and create dynamic experiences that capture new customers and build brand loyalty. For over 40 years, CSG’s technologies and people have helped some of the world’s most recognizable brands solve their toughest business challenges and evolve to meet the demands of today’s digital economy with future-ready solutions that drive exceptional customer experiences. With more than 5,000 employees in over 20 countries, CSG is the trusted technology provider for leading global brands in telecommunications, retail, financial services and healthcare. Our solutions deliver real world outcomes to more than 900 customers in over 120 countries.", "num_of_employees": "not-found", "website": "https://www.csgi.com", "industry": "Software Development", "company_size_approx": "5,001-10,000", "headquarters": "Englewood, Colorado", "type": "Public Company", "founded": "1994", "specialties": "Business Support Solutions, Revenue Management, Customer Experience, Digital Transformation, Managed Services, IoT, 5G, Telecom, and OTT", "funding": "US$ 375.0M", "funding_total_rounds": 1, "funding_option": "Post IPO debt", "last_funding_round": "Oct 6, 2023"},
{"company_name": "FedEx ACC", "linkedin_followers_count": "not-found", "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFPXXvhIMyQag/company-logo_200_200/company-logo_200_200/0/1686317416677/fedex_acc_logo?e=2147483647&v=beta&t=-g4tS-cH9u4Y1WnRsJq-XrdyVy1aYuB8qVe41C8SL00", "about_us": "FedEx India supports the technological and digital requirements of the entire FedEx enterprise. When you join FedEx, you join a team that’s 500,000 strong around the world with one purpose: to provide customers with outstanding experiences as we connect the world to what’s next. We deliver packages but that’s not all we do. We’re a leader in technology solutions, providing data insights that boost opportunities for global customers in e-commerce. We are creating the world’s most flexible, efficient, and intelligent supply chain for our customers, and we need passionate people committed to the same values focused on care, balance, inclusivity, results, and transformation.\n\nJoin us as we deliver what’s next!", "num_of_employees": "not-found", "website": "https://www.fedex.com/en-in/about/careers/it-jobs.html", "industry": "Technology, Information and Internet", "company_size_approx": "501-1,000", "headquarters": "Hyderabad", "type": "Public Company"},
{"company_name": "LearningMate", "linkedin_followers_count": 154184, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQFP-9hwAPDsCg/company-logo_200_200/company-logo_200_200/0/1719256517153/learningmate_logo?e=2147483647&v=beta&t=5BL-5xvPbMbI3Z_Enp-KJExacYp-5IUKEYASpb68tok", "about_us": "LearningMate is a technology company offering domain expertise in teaching and learning solutions - leveraging digital, cloud, process automation, data, and strong learning design principles.\n\nFor more than twenty years, LearningMate has been working with education institutions across the globe to help them build, deploy, and streamline their digital infrastructure. Through our powerful mix of products and services, we are proud to help lead the world toward a future where education is accessible, affordable, and effective.\n\nSince 2001, we have grown to employ more than 3,500 associates spread across the world and serve a global clientele of education publishers, traditional and nontraditional EdTech companies, K-20 schools, universities and career colleges, government agencies, non-profits, corporate training, and education consortia.", "num_of_employees": "not-found", "website": "http://www.learningmate.com", "industry": "E-Learning Providers", "company_size_approx": "1,001-5,000", "headquarters": "Princeton, New Jersey", "type": "Privately Held", "founded": "2001", "specialties": "Curriculum & Media Development, Assessments, Engineering, Big Education Data, Education, Corporate Training, Instructional Design, Editorial Services, authoring tools, Accessibility Compliance, e-learning, Enterprise Education Solutions, Technology, enterprise architecture, learning object repository, Learning Content Management System, Mobile Learning, Standards Management, Workforce Development, Workforce Training, AI, Content Management , Curriculum Development, Artificial Intelligence, and Data Solutions", "funding": "US$ 10.0M", "funding_total_rounds": 1, "funding_option": "Private equity", "last_funding_round": "Aug 9, 2009"},
{"company_name": "Innovaccer", "linkedin_followers_count": 150136, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQHr2bGXOCcWkw/company-logo_200_200/company-logo_200_200/0/1688541719288/innovaccer_logo?e=2147483647&v=beta&t=6m_KQXu4vV-a9D23bzcel9uEUabvh8fy83R0kruPqis", "about_us": "Innovaccer Inc. is the #1 data platform for value-based care. The Innovaccer platform unifies patient data across systems and care settings, and empowers healthcare organizations with scalable, modern applications that improve clinical, financial, operational, and experiential outcomes. Innovaccer’s EHR-agnostic solutions have been deployed across more than 1,600 hospitals and clinics in the US, enabling care delivery transformation for more than 96,000 clinicians, and helping providers work collaboratively with payers and life sciences companies. Innovaccer has helped its customers unify health records for more than 54 million people and generate over $1 billion in cumulative cost savings. The Innovaccer platform is the #1 rated Best-in-KLAS data and analytics platform by KLAS, and the #1 rated population health technology platform by Black Book. For more information, please visit innovaccer.com.", "num_of_employees": "not-found", "website": "https://www.innovaccer.com", "industry": "IT Services and IT Consulting", "company_size_approx": "1,001-5,000", "headquarters": "San Francisco, California", "type": "Privately Held", "founded": "2014", "specialties": "Quality Reporting, Interoperable Data Lake, Drilled Down Contract Performance, population health, Health Equity, value-based care, healthIT, healthtech, and customer relationship management", "funding": "US$ 150.0M", "funding_total_rounds": 7, "funding_option": "Series E", "last_funding_round": "Jan 15, 2022"},
{"company_name": "Paytm Payments Bank", "linkedin_followers_count": 139723, "company_logo_url": "https://media.licdn.com/dms/image/v2/C510BAQH2_IrhV7G4pA/company-logo_200_200/company-logo_200_200/0/1630618393879/paytmbank_logo?e=2147483647&v=beta&t=5n_a0gSC9z0CnpMU78NvZg0Ewg9rgm3DO8mZb9_C5gg", "about_us": "Paytm Payments Bank is India’s mobile-first bank with zero balance-zero digital transaction charge accounts. Owned and governed solely by Indians, Paytm Payments Bank was launched on May 23, 2017.  Vijay Shekhar Sharma owns majority stake in the company, with the remaining share owned by Indian firm One97 Communications Ltd.  Paytm Payments Bank is building India’s first world class digital bank with a mission and commitment to serve to all underbanked and underserved indians. We will bring half-a-billion Indians to mainstream economy. \nNo Fear\nNo Greed\nNo Entitlement", "num_of_employees": "not-found", "website": "http://www.paytmbank.com", "industry": "Banking", "company_size_approx": "1,001-5,000", "headquarters": "Noida, Uttar Pradesh", "type": "Privately Held", "founded": "2017"},
{"company_name": "Yellow.ai", "linkedin_followers_count": 135127, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQG2ZQfhH46cmw/company-logo_200_200/company-logo_200_200/0/1682433539825/yellowdotai_logo?e=2147483647&v=beta&t=r9bwGi-4OH7gX2P4PDc9Uj1yXWOIjBWmipZQ95P1zHo", "about_us": "Yellow.ai empowers enterprises to create memorable customer conversations through our generative AI-powered customer service automation platform. Our vision is to drive toward the future of fully autonomous customer support that unlocks unparalleled efficiency and significantly reduces operational costs. \n\nHeadquartered in San Mateo, Yellow.ai serves over 1000 enterprises, including Sony, Domino’s, Hyundai, Ferrellgas, Waste Connections, Randstad, Tiket.com, Lulu Group International, Arabic Radio Network, Papa Johns, Hyundai, Volkswagen, ITC Ltd, OYO, Skoda Auto, across 85+ countries. \n\nOur platform is built on multi-LLM architecture and continuously trained on 16B+ conversations annually, enabling businesses to deliver elevated experiences and build lasting customer relationships. \n\nFounded in 2016 with offices across six countries, Yellow.ai has raised over $102 million from blue-chip investors.", "num_of_employees": "not-found", "website": "https://yellow.ai/", "industry": "Software Development", "company_size_approx": "1,001-5,000", "headquarters": "San Mateo, California", "type": "Privately Held", "founded": "2016", "specialties": "customer service automation, Generative AI, contact center solution, customer support automation, Artificial intelligence, customer engagement, Chatbots, Voice assistants, Google assistant, customer experience, banking automation, retail automation, WhatsApp chatbot, sales automation, helpdesk ticketing system, Voice AI , Voice Assistants, and Customer Experience Automation", "funding": "US$ 78.2M", "funding_total_rounds": 5, "funding_option": "Series C", "last_funding_round": "Sep 4, 2021"},
{"company_name": "Sterling and Wilson", "linkedin_followers_count": 128801, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQHJu-YjJEMblA/company-logo_200_200/company-logo_200_200/0/1674462367305/sterlingandwilson_logo?e=2147483647&v=beta&t=_PtxHn-EkV7BRNJHQEJ4ZaeKh_zlsZf_nPp3mLtp3Ng", "about_us": "Sterling and Wilson is one of India’s leading engineering, procurement, and construction (EPC) companies. \n\nBeginning in 1927, the story of Sterling and Wilson is one of innovation, geographic expansion and a penchant for perfection. Having grown from a small family-run business into a multinational EPC solutions provider, Sterling and Wilson has come a long way.\n\nOver the course of our long and proud history, we have dared to dream big. Backed by our industry-leading team and the support of all our stakeholders, while always being guided by our corporate values, we have delivered on those dreams for more than nine decades.\n\nToday, Sterling and Wilson operates across 30 countries with a strong presence in regions such as India, Southeast Asia, Middle East, Africa, Europe, the Americas, and Australia. Its diverse portfolio includes Data Centers, Renewable Energy, MEP-IEPC, Transmission & Distribution, Diesel Generators and E-Mobility.\n\nWith over 5,000 employees worldwide, our people are our biggest asset. Our teams are consumer-focussed, performance-driven, and future-capable, assuring the best possible customer experience.", "num_of_employees": "not-found", "website": "http://www.sterlingandwilson.com/", "industry": "Engineering Services", "company_size_approx": "1,001-5,000", "headquarters": "Mumbai, Maharashtra", "type": "Privately Held", "founded": "1927", "specialties": "MEP-IEPC, Transmission & Distribution, Data Centers, DG Sets, and Renewable Energy", "funding": "US$ 100.8M", "funding_total_rounds": 3, "funding_option": "Debt financing", "last_funding_round": "Feb 22, 2022"},
{"company_name": "not-found", "linkedin_followers_count": "not-found", "company_logo_url": "not-found", "about_us": "not-found", "num_of_employees": "not-found"},
{"company_name": "OSF Digital", "linkedin_followers_count": 124814, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGCvpnqFmtI1A/company-logo_200_200/company-logo_200_200/0/1630630953931?e=2147483647&v=beta&t=_CAlhc9aHonj4pQ4F0XYZIflezkgQz99HZWRvwvAsL8", "about_us": "OSF Digital is a top digital transformation and leading global commerce solutions company, known for its expertise in data-driven AI-powered Salesforce multi-cloud solutions, enterprise CRM, CMS, OMS, connected commerce, online shop management, and cloud application development. Our agile approach allows us to scale global growth quickly, and deliver innovative solutions across channels, devices and locales to enterprises and emerging businesses across B2B and B2C sectors.\n\nAs a certified Salesforce partner, we are consistently recognized for our innovative solutions, exemplifying our unwavering commitment to advancing digital transformation. Notable awards include the 2023 Salesforce Partner Innovation Award in Emerging Technology - Customer 360 and the 2022 Salesforce Commerce Cloud Partner of the Year for Best Go Faster with Commerce. Our core values—OneTeam, ResultsAnywhere, Outperform, OSFExcellence, Driven By Change, and OSF Strong—guide our client, partner, employee, and community engagements, underpinning our commitment to excellence and continuous innovation.\n\nAcknowledged for our dedication to our team's well-being and commitment to cultivating an environment where innovative ideas thrive, we're honored to be a Great Place to Work® Certified™ organization in ASEAN and ANZ and listed among Fast Company's The 50 Best Workplaces for Innovators.\n\nWe’re proud to celebrate our 20th anniversary with a team of over 2200 employees working from anywhere, and operating in various locations worldwide, including Canada, the U.S., the UK, France, Germany, Brazil, Spain, Romania, Turkey, Ukraine, Colombia, Australia, New Zealand, and Japan. Ultimately, OSF Digital Foundation is actively involved in philanthropic, cultural, and educational activities to help people in the communities where OSF operates to build a better life.\n\nFor more information about our services and expertise, or to speak with a digital transformation specialist, please visit osf.digital", "num_of_employees": "not-found", "website": "https://osf.digital/", "industry": "IT Services and IT Consulting", "company_size_approx": "1,001-5,000", "headquarters": "Quebec, Quebec", "type": "Privately Held", "specialties": "cloud technology consulting, cloud technology integrations, cloud application development, digital transformation, multi cloud solutions, connected commerce strategies, ecommerce replatforming, Salesforce Platinum Partner, Salesforce products integration, Salesforce Marketing Cloud, Salesforce Commerce Cloud, Salesforce Service Cloud, Salesforce Sales Cloud, Salesforce Communities Cloud, B2C ecommerce, B2B ecommerce, Quick Start Commerce, omnichannel commerce, mobile commerce, ecommerce support and maintenance, storefront management, ecommerce enablement, global commerce rollout, headless commerce, commerce subscriptions, commerce marketplaces, artificial intelligence, and Data Cloud", "funding": "US$ 100.0M", "funding_total_rounds": 5, "funding_option": "Series C", "last_funding_round": "May 13, 2022"},
{"company_name": "AppsFlyer", "linkedin_followers_count": 122859, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQESCkUg-iUCmA/company-logo_200_200/company-logo_200_200/0/1704716437944/appsflyerhq_logo?e=2147483647&v=beta&t=3C-sd7gYwzhbyFwXBP6oi7sGg6jJjsziLGXaN3TWzxU", "about_us": "AppsFlyer helps brands make good choices for their business and their customers with its advanced measurement, data analytics, deep linking, engagement, fraud protection, data clean room and privacy-preserving technologies. Built on the idea that brands can increase customer privacy while providing exceptional experiences, AppsFlyer empowers thousands of creators and 10,000+ technology partners to create better, more meaningful customer relationships. To learn more, visit www.appsflyer.com.", "num_of_employees": "not-found", "website": "https://www.appsflyer.com/", "industry": "Technology, Information and Internet", "company_size_approx": "1,001-5,000", "headquarters": "San Francisco, CA", "type": "Privately Held", "specialties": "Mobile Apps Marketing, Marketing, iPhone, Android, App Store, iOS, Google Play, Advertising, Mobile Measurement, Attribution Analytics, Deep Linking, and Mobile Marketing", "funding": "not-found", "funding_total_rounds": 6, "funding_option": "Series unknown", "last_funding_round": "Dec 24, 2020"},
{"company_name": "GlobalData Plc", "linkedin_followers_count": "not-found", "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQG3cXREO4vwUw/company-logo_200_200/company-logo_200_200/0/1645714719228/globaldataplc_logo?e=2147483647&v=beta&t=fToyuoevTkQzhkiblA1fWA6lvs8xvYw6Kg44dEJRwLs", "about_us": "In an increasingly fast-moving, complex, and uncertain world, it’s never been harder for organizations and decision-makers to predict and navigate the future. Which is why GlobalData exists - its mission is to help clients decode the future and profit from faster, more informed decisions.\n\nAs a leading information services company, thousands of clients rely on GlobalData for trusted, timely, and actionable intelligence. Its solutions are designed to provide a daily edge to professionals within corporations, financial institutions, professional services, and government agencies.", "num_of_employees": "not-found", "website": "https://www.globaldata.com/", "industry": "Information Services", "company_size_approx": "1,001-5,000", "headquarters": "London", "type": "Public Company", "founded": "2010"}
]